// 5. 5. Создайте программу, которая запрашивает у пользователя два целых числа **a** и **b**, после чего выводит на экран результаты следующих математических операций: 
    
// - сумма a и b; 

// - разница между a и b;

// - произведение a и b; 

// - частное от деления a на b; 

// - остаток от деления a на b;  

// - результат возведения числа a в степень b

let a = Number(prompt('Введите два целых числа для a и b. Первое число: '));
let b = Number(prompt('Введите второе число :'));

document.write(`Сумма a и b: ${a + b} <br>`);
document.write(`Разница между a и b: ${a - b} <br>`);
document.write(`Произведение a и b: ${a * b} <br>`);
document.write(`Частное от деления a на b: ${a / b} <br>`);
document.write(`Остаток от деления a на b: ${a % b} <br>`);
document.write(`Результат возведения числа a в степень b: ${a ** b} <br>`);

console.log(`Сумма a и b : ${a +b }`);
console.log(`Разница между a и b : ${a - b}`);
console.log(`Произведение a и b : ${a * b}`);
console.log(`Частное от деления a на b : ${a / b}`);
console.log(`Остаток от деления a на b : ${a % b}`);
console.log(`Результат возведения числа a в степень b : ${a ** b}`);

// alert(`Cумма a и b: ${a + b}`);
// alert(`Разница между a и b: ${a - b}`);
// alert(`Произведение a и b: ${a * b}`);
// alert(`Частное от деления a на b: ${a / b}`);
// alert(`Остаток от деления a на b: ${a % b}`);
// alert(`Результат возведения числа a в степень b: ${a ** b}`);

